H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    for (uint8_t i = 0; i < n; i++) {
        int16_t row_y = contentY() + ((int16_t)i - menu_scroll) * (int16_t)itemH();
        if (row_y < (int16_t)contentY() ||
            row_y + (int16_t)itemH() > (int16_t)(contentY() + contentH())) continue;
        bool sel = (i == (int16_t)menu_sel);

        if (i == 1) { choiceRow(row_y, "Font Color",   FONT_COLOR_NAMES[font_color_idx], sel); continue; }
        if (i == 2) { choiceRow(row_y, "Verse # Color", FONT_COLOR_NAMES[vnum_color_idx], sel); continue; }
        if (i == 6) { choiceRow(row_y, "Highlight",     ACCENT_NAMES[accent_idx],        sel); continue; }

        if (i == 4) {
            // Brightness row: "Brightness" label + [-] X/20 [+] buttons.
            drawListRow(row_y, "Brightness", sel, false);
            uint16_t bg_c  = sel ? sel_bg() : bg();
            int16_t  btn_y = row_y + (itemH() - btn_h) / 2;
            int16_t  txt_y = btn_y + (btn_h - 16) / 2;
            int16_t  num_y = row_y + (itemH() - 16) / 2;
            int16_t plus_bx = (int16_t)scrW() - 4 - btn_w;
            tft.fillRoundRect(plus_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
            tft.drawRoundRect(plus_bx, btn_y, btn_w, btn_h, btn_r, dim_fg());
            tft.setTextColor(TFT_WHITE, hdr_bg());
            tft.drawCentreString("+", plus_bx + btn_w / 2, txt_y, 2);
            char nbuf[8];
            snprintf(nbuf, sizeof(nbuf), "%d/20", bl_idx + 1);
            int16_t num_w = (int16_t)tft.textWidth(nbuf, 2);
            int16_t num_x = plus_bx - 4 - num_w;
            tft.setTextColor(fg(), bg_c);
            tft.drawString(nbuf, num_x, num_y, 2);
            int16_t minus_bx = num_x - 4 - btn_w;
            tft.fillRoundRect(minus_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
            tft.drawRoundRect(minus_bx, btn_y, btn_w, btn_h, btn_r, dim_fg());
            tft.setTextColor(TFT_WHITE, hdr_bg());
            tft.drawCentreString("-", minus_bx + btn_w / 2, txt_y, 2);
            continue;
        }

        char buf[48];
        if (i == 0) {
            const char* sz = (font_num == 1) ? "Small" : (font_num == 2) ? "Medium" : "Large";
            snprintf(buf, sizeof(buf), "Font Size: %s", sz);
        } else if (i == 3) {
            snprintf(buf, sizeof(buf), "Theme: %s", dark_mode ? "Dark" : "Light");
        } else if (i == 5) {
            const char* tl = (mode == MODE_SONGS) ? "Song Book"
                           : (mode == MODE_DICT)  ? "Dictionary" : "Translation";
            snprintf(buf, sizeof(buf), "%s: %s", tl,
                     trans_count > 0 ? trans_stems[cur_trans] : "-");
        } else if (i == 7) {
            snprintf(buf, sizeof(buf), "Orientation: %s", orientation ? "Flipped" : "Normal");
        } else if (i == 8) {
            strncpy(buf, "Boot OTA_1", sizeof(buf) - 1); buf[sizeof(buf) - 1] = 0;
#ifndef HAS_CAP_TOUCH
        } else {  // i == 9
            strncpy(buf, "Calibrate Touch", sizeof(buf) - 1); buf[sizeof(buf) - 1] = 0;
#endif
        }
        drawListRow(row_y, buf, sel, false);
    }

    drawScrollBar((int16_t)n, vis, menu_scroll);
}

void BibleInterface::drawSettings() {
    tft.fillScreen(bg());
    drawHeader("Settings");
    redrawSettingsContent();
    drawNavBar("Back", "", "");
}

// ─────────────────────────────────────────────────────────────────────────────
// Bookmarks screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawBookmarks() {
    tft.fillScreen(bg());
    drawHeader("Bookmarks");
    if (bm_count == 0) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("No bookmarks yet", scrW()/2, contentY() + 20, 2);
        drawNavBar("Back", "", "");
        return;
    }
    uint8_t vis = visItems();
    for (uint8_t i = 0; i < vis && (bm_scroll + i) < bm_count; i++) {
        bool sel = (bm_scroll + i) == (uint8_t)bm_sel;
        drawListRow(contentY() + i * itemH(), bookmarks[bm_scroll + i].label, sel, false);
    }
    drawScrollBar(bm_count, vis, bm_scroll);
    drawNavBar("Back", "View", "Del");
    if (bm_confirm_pending) drawConfirmDelete();
}

// Delete-confirmation popup — drawn on top of the bookmark list.
// Geometry is computed from scrW()/scrH() so it scales for both boards.
//
//  ┌─────────────────────────────────┐
//  │       Delete bookmark?          │
//  │                                 │
//  │  [ Cancel ]       [ Delete ]    │
//  └─────────────────────────────────┘
//
// Touch detection: lift inside the Delete button confirms; anywhere else cancels.
void BibleInterface::drawConfirmDelete() {
    int16_t pop_w = (int16_t)scrW() - 40;   // 20 px margin each side
    int16_t pop_h = 80;
    int16_t pop_x = 20;
    int16_t pop_y = (int16_t)(scrH() / 2) - 40;

    // Panel — filled with bg() so it covers content behind it
    tft.fillRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, bg());
    tft.drawRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, dim_fg());
    tft.drawRoundRect(pop_x + 1, pop_y + 1, pop_w - 2, pop_h - 2, 6, dim_fg());

    // Message
    tft.setTextColor(fg(), bg());
    tft.drawCentreString("Delete bookmark?", scrW() / 2, pop_y + 10, 2);

    // Button row — two equal-width buttons separated by a small gap
    int16_t btn_y  = pop_y + 44;
    int16_t btn_h  = 28;
    int16_t half_w = pop_w / 2 - 6;    // each button width
    int16_t del_x  = pop_x + pop_w / 2 + 2;

    // Cancel (left)
    tft.fillRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, dim_fg());
    tft.setTextColor(TFT_WHITE, hdr_bg());
    tft.drawCentreString("Cancel", pop_x + 4 + half_w / 2, btn_y + (btn_h - 8) / 2, 1);

    // Delete (right) — red border + red text to signal destructive action
    tft.fillRoundRect(del_x, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(del_x, btn_y, half_w, btn_h, 4, TFT_RED);
    tft.setTextColor(TFT_RED, hdr_bg());
    tft.drawCentreString("Delete", del_x + half_w / 2, btn_y + (btn_h - 8) / 2, 1);
}

// ─────────────────────────────────────────────────────────────────────────────
// Touch input
// ─────────────────────────────────────────────────────────────────────────────
bool BibleInterface::getTouch(uint16_t* tx, uint16_t* ty) {
#ifdef HAS_CAP_TOUCH
    uint16_t raw_x, raw_y;
    uint8_t touches = ft6336_update(&raw_x, &raw_y);
    if (touches == 0) { last_pressed = false; return false; }
    // FT6336 returns coordinates in panel orientation; flip for 180° orientation.
    *tx = raw_x;
    *ty = raw_y;
    if (orientation == 1) { *tx = scrW() - 1 - *tx; *ty = scrH() - 1 - *ty; }
#else
    uint16_t cal[5] = {0,0,0,0,0}; // use default calibration
    (void)cal;
    if (!tft.getTouch(tx, ty, 600)) { last_pressed = false; return false; }
#endif
    uint32_t now = millis();
    if (last_pressed && (now - last_input_ms) < 200) return false;
    last_pressed   = true;
    last_input_ms  = now;
    return true;
}

// Raw touch poll — no debounce, used for gesture detection in list views.
bool BibleInterface::pollTouch(uint16_t* tx, uint16_t* ty) {
#ifdef HAS_CAP_TOUCH
    uint16_t raw_x, raw_y;
    if (!ft6336_update(&raw_x, &raw_y)) { last_pressed = false; return false; }
    *tx = raw_x; *ty = raw_y;
    // FT6336 reports panel-native coords; flip them for 180° orientation.
    if (orientation == 1) { *tx = scrW() - 1 - *tx; *ty = scrH() - 1 - *ty; }
#else
    // Resistive: TFT_eSPI getTouch() already maps through the active setRotation.
    if (!tft.getTouch(tx, ty, 600)) { last_pressed = false; return false; }
#endif
    last_pressed  = true;
    last_input_ms = millis();
    return true;
}

bool BibleInterface::touchInHeader(uint16_t /*x*/, uint16_t y) {
    return y < hdrH();
}

