H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
            if (v > 0) {
                if (sel_verse_first == 0) {
                    // Nothing selected → select this verse
                    sel_verse_first = sel_verse_last = v;
                } else if (v >= sel_verse_first && v <= sel_verse_last) {
                    // Tap on already-selected verse
                    if (sel_verse_first == sel_verse_last) {
                        sel_verse_first = sel_verse_last = 0;  // deselect single
                    } else if (v == sel_verse_first) {
                        sel_verse_first++;                      // shrink from start
                    } else if (v == sel_verse_last) {
                        sel_verse_last--;                       // shrink from end
                    } else {
                        sel_verse_first = sel_verse_last = v;  // middle → reset to this
                    }
                } else if (v == sel_verse_last + 1) {
                    sel_verse_last = v;                         // extend end
                } else if (v + 1 == sel_verse_first) {
                    sel_verse_first = v;                        // extend start
                } else {
                    sel_verse_first = sel_verse_last = v;       // non-adjacent → reset
                }
                drawReadingLines();
                return;
            }
        }

        // Upper half = previous page/chapter, lower = next
        uint16_t mid = scrH() / 2;
        if (touch_down_y < mid) {
            int16_t prev = read_line - (int16_t)visLines();
            if (prev >= 0) {
                scroll_px = (float)prev * (float)lineH();
                drawReadingLines();
            } else if (scroll_px > 0.f) {
                scroll_px = 0.f;
                drawReadingLines();
            } else if (cur_chapter > 1) {
                goToReading(cur_chapter - 1);
            }
        } else {
            int16_t next = read_line + (int16_t)visLines();
            if (next < (int16_t)line_count) {
                scroll_px = (float)next * (float)lineH();
                drawReadingLines();
            } else if (cur_chapter < bookChapters(cur_book)) {
                goToReading(cur_chapter + 1);
            }
        }
    }
}

void BibleInterface::handleSettingsInput() {
    const uint8_t SETTINGS_N = settingsRowCount();
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched down ──────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;

        // Header and nav fire immediately on press (no drag ambiguity)
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW()/3) goBack();
            return;
        }
        // Highlight touched (absolute) item immediately for press feedback.
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && (menu_scroll + hi) < (int16_t)SETTINGS_N) {
            menu_sel = menu_scroll + hi;
            redrawSettingsContent();
        }
        return;
    }

    // ── Finger held — drag to scroll when the list overflows the screen ───────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
            drag_origin_px  = (float)menu_scroll * (float)itemH();
            menu_sel = -1;
        }
        if (scroll_dragging) {
            int16_t max_scroll = (SETTINGS_N > visItems()) ?
                                 (int16_t)(SETTINGS_N - visItems()) : 0;
            float px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            float maxpx = (float)max_scroll * (float)itemH();
            if (px < 0.f) px = 0.f;
            if (px > maxpx) px = maxpx;
            int16_t ns = (int16_t)(px / (float)itemH());
            if (ns != menu_scroll) { menu_scroll = ns; redrawSettingsContent(); }
        }
        return;
    }

    // ── Finger lifted — activate the item highlighted on press ───────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) { scroll_dragging = false; return; }
        if (menu_sel < 0 || menu_sel >= (int16_t)SETTINGS_N) return;

        switch (menu_sel) {
            case 0: // Font size
                font_num = (font_num == 1) ? 2 : (font_num == 2) ? 4 : 1;
                prefs.putUChar("font", font_num);
                redrawSettingsContent();
                break;
            case 1: // Font color — [>] forward, [<] backward (boundary at scrW()-32)
                if ((int16_t)touch_down_x >= (int16_t)scrW() - 32)
                    font_color_idx = (uint8_t)((font_color_idx + 1) % FONT_COLOR_COUNT);
                else
                    font_color_idx = (font_color_idx == 0) ? FONT_COLOR_COUNT - 1
                                                           : font_color_idx - 1;
                prefs.putUChar("fontcol", font_color_idx);
                redrawSettingsContent();
                break;
            case 2: // Verse # color
                if ((int16_t)touch_down_x >= (int16_t)scrW() - 32)
                    vnum_color_idx = (uint8_t)((vnum_color_idx + 1) % FONT_COLOR_COUNT);
                else
                    vnum_color_idx = (vnum_color_idx == 0) ? FONT_COLOR_COUNT - 1
                                                           : vnum_color_idx - 1;
                prefs.putUChar("vnumcol", vnum_color_idx);
                redrawSettingsContent();
                break;
            case 3: // Theme — bg/header/nav all change, repaint each zone without fillScreen
                dark_mode = !dark_mode;
                prefs.putBool("dark", dark_mode);
                drawHeader("Settings");
                redrawSettingsContent();
                drawNavBar("Back", "", "");
                break;
            case 4: // Brightness — [+] button starts at scrW()-32; everything left = [-]
                if ((int16_t)touch_down_x >= (int16_t)scrW() - 32) {
                    if (bl_idx < 19) blSet(bl_idx + 1);
                } else {
                    if (bl_idx > 0)  blSet(bl_idx - 1);
                }
                redrawSettingsContent();
                break;
            case 5: // Song Book / Translation / Dictionary cycle
                if (trans_count > 1) {
                    cur_trans = (cur_trans + 1) % trans_count;
                    prefs.putUChar("trans", cur_trans);
                    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
                    book_idx_valid = false;
                    if (mode != MODE_BIBLE) {
                        if (loadToc(trans_stems[cur_trans])) {
                            if (cur_book >= numBooks()) cur_book = 0;
                            cur_sec     = (numBooks() > 0) ? bookSection(cur_book) : 0;
                            cur_chapter = 1;
                        }
                    } else if (cur_book >= numBooks()) {
                        cur_book = 0;
                    }
                }
                redrawSettingsContent();
                break;
            case 6: // Highlight — [>] forward, [<] backward (boundary at scrW()-32)
                if ((int16_t)touch_down_x >= (int16_t)scrW() - 32)
                    accent_idx = (uint8_t)((accent_idx + 1) % ACCENT_COUNT);
                else
                    accent_idx = (accent_idx == 0) ? ACCENT_COUNT - 1 : accent_idx - 1;
                prefs.putUChar("accent", accent_idx);
                redrawSettingsContent();
                break;
            case 7: // Orientation (global) — flip 180°; saved in the "menu" namespace
                orientation = orientation ? 0 : 1;
                {
                    Preferences mp;
                    if (mp.begin("menu", false)) { mp.putUChar("orient", orientation); mp.end(); }
                }
                applyOrientation();
                drawSettings();   // full repaint in the new orientation
                return;
            case 8: // Boot Marauder
                bootMarauder();
                return;
#ifndef HAS_CAP_TOUCH
            case 9: // Calibrate Touch
                runTouchCalibration();
                drawSettings();
                return;
#endif
        }
    }
}

void BibleInterface::handleBookmarksInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Delete confirmation popup ─────────────────────────────────────────────
    // While the popup is visible, block all normal list input and only act on
    // a tap inside the Delete button (anywhere else = Cancel).
    if (bm_confirm_pending) {
        if (down && !touch_was_down) {
            touch_was_down = true;
            touch_down_x = tx;   // save position — pollTouch doesn't write tx/ty on lift
            touch_down_y = ty;
        } else if (!down && touch_was_down) {
            touch_was_down = false;
            // Recompute Delete button bounds (must match drawConfirmDelete)
            int16_t pop_w  = (int16_t)scrW() - 40;
            int16_t pop_y  = (int16_t)(scrH() / 2) - 40;
            int16_t btn_y  = pop_y + 44;
            int16_t btn_h  = 28;
            int16_t half_w = pop_w / 2 - 6;
            int16_t del_x  = 20 + pop_w / 2 + 2;
            // Use saved down-position — tx/ty are stale on lift (pollTouch returns false)
            bool in_del = ((int16_t)touch_down_x >= del_x && (int16_t)touch_down_x < del_x + half_w &&
                           (int16_t)touch_down_y >= btn_y  && (int16_t)touch_down_y < btn_y + btn_h);
            if (in_del && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                for (uint8_t i = (uint8_t)bm_sel; i < bm_count - 1; i++)
                    bookmarks[i] = bookmarks[i + 1];
                bm_count--;
                if (bm_sel >= (int16_t)bm_count && bm_sel > 0) bm_sel--;
                saveBookmarks();
            }
            bm_confirm_pending = false;
            needs_redraw = true;
        }
        return;
    }

    // ── Finger just touched down ─────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW()/3) {
                goBack(); return;
            } else if (tx > 2*(scrW()/3)) {
                // "Del" — show confirmation popup
                if (bm_count > 0 && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                    bm_confirm_pending = true;
                    needs_redraw = true;
                }
            } else {
                // "View" — navigate to the selected bookmark
                if (bm_count > 0 && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                    jumpToBookmark((uint8_t)bm_sel);
                }
            }
            return;
        }
        // Highlight the touched bookmark immediately for press feedback
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && (bm_scroll + hi) < (int16_t)bm_count) {
            bm_sel = bm_scroll + hi;
            redrawListContent(bm_count);
        }
        return;
    }

