H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
const char* BibleInterface::basePath() const {
    switch (mode) {
        case MODE_SONGS: return SONGS_SD_BASE;
        case MODE_DICT:  return DICT_SD_BASE;
        default:         return BIBLE_SD_BASE;
    }
}
const char* BibleInterface::nvsNamespace() const {
    switch (mode) {
        case MODE_SONGS: return "songs";
        case MODE_DICT:  return "dict";
        default:         return "bible";
    }
}
void BibleInterface::bmPath(char* out, size_t n) const {
    snprintf(out, n, "%s/bookmarks.txt", basePath());
}
void BibleInterface::srchHistPath(char* out, size_t n) const {
    snprintf(out, n, "%s/srch_hist.txt", basePath());
}

// ─────────────────────────────────────────────────────────────────────────────
// Runtime structure tables (Songs / Dictionary) — allocated from PSRAM if present
// ─────────────────────────────────────────────────────────────────────────────
// Allocate from PSRAM when available, but ALWAYS fall back to internal SRAM if
// PSRAM is absent or not enabled in the build — these tables are small (a few KB,
// up to ~50 KB for the largest songbook) and must never fail just because PSRAM
// isn't there. A NULL here used to crash Bible reads and bounce Songs/Dict to the menu.
static inline void* rt_alloc(size_t sz) {
#ifdef HAS_PSRAM
    void* p = ps_malloc(sz);
    if (p) return p;
#endif
    return malloc(sz);
}
#define RT_MALLOC(sz) rt_alloc(sz)

// Map the first character of a dictionary query to its letter-bucket book code
// (must match generate_dict_xml.py: a-z -> "A".."Z", digit -> "NUM", else "SYM";
// German umlauts fold to their base letter, matching the generator's bucketing).
static void dictBucketCode(char first, char* out) {
    unsigned char c = (unsigned char)first;
    char base = 0;
    if      (c >= 'A' && c <= 'Z') base = (char)(c - 'A' + 'a');
    else if (c >= 'a' && c <= 'z') base = (char)c;
    else if (c == 0x80 || c == 0x81) base = 'a';   // Ä ä
    else if (c == 0x82 || c == 0x83) base = 'o';   // Ö ö
    else if (c == 0x84 || c == 0x85) base = 'u';   // Ü ü
    else if (c == 0x86)              base = 's';    // ß
    if (base >= 'a' && base <= 'z') { out[0] = (char)(base - 'a' + 'A'); out[1] = 0; return; }
    if (c >= '0' && c <= '9') { strcpy(out, "NUM"); return; }
    strcpy(out, "SYM");
}

// Last loadToc() failure reason (shown on screen by selectTranslation).
static const char* g_toc_err = "";

void BibleInterface::freeRuntime() {
    if (rt_books)     { free(rt_books);     rt_books     = nullptr; }
    if (rt_secs)      { free(rt_secs);      rt_secs      = nullptr; }
    if (book_offsets) { free(book_offsets); book_offsets = nullptr; }
    rt_book_count = 0; rt_sec_count = 0; book_offsets_cap = 0;
}

// Load <base>/<stem>.toc into rt_books[], rt_secs[] and book_offsets[].
//   S|<section display name>
//   B|<code>|<display>|<chapterCount>|<sectionIndex>|<byteOffset>
// Books must be grouped by section and contiguous (the generator guarantees this).
bool BibleInterface::loadToc(const char* stem) {
    freeRuntime();
    char path[80];
    snprintf(path, sizeof(path), "%s/%s.toc", basePath(), stem);

    // Open ONCE and read the whole file into a buffer, then parse from memory.
    // (Avoids reopening the same SD file twice, which is unreliable on some builds.)
    g_toc_err = "";
    File f = SD.open(path);
    if (!f) { g_toc_err = "file not found"; Serial.printf("[%s] TOC missing: %s\n", nvsNamespace(), path); return false; }
    if (f.isDirectory()) { f.close(); g_toc_err = "is a directory"; return false; }
    size_t sz = f.size();
    if (sz == 0) { f.close(); g_toc_err = "file is empty"; Serial.printf("[%s] TOC empty: %s\n", nvsNamespace(), path); return false; }
    char* buf = (char*)RT_MALLOC(sz + 1);
    if (!buf) { f.close(); g_toc_err = "low memory (enable PSRAM)"; Serial.println(F("[toc] buf alloc fail")); return false; }
    size_t got = f.read((uint8_t*)buf, sz);
    f.close();
    buf[got] = 0;

    // Pass 1: count S| and B| lines.
    uint16_t nsec = 0, nbook = 0;
    for (char* ln = buf; *ln; ) {
        char* nl = strchr(ln, '\n');
        size_t len = nl ? (size_t)(nl - ln) : strlen(ln);
        if (len >= 2 && ln[1] == '|') {
            if      (ln[0] == 'S') nsec++;
            else if (ln[0] == 'B') nbook++;
        }
        if (!nl) break;
        ln = nl + 1;
    }
    if (nbook == 0) { free(buf); g_toc_err = "no B| rows (bad TOC)"; return false; }

    rt_secs      = (RtSec*)   RT_MALLOC(sizeof(RtSec)   * (nsec ? nsec : 1));
    rt_books     = (RtBook*)  RT_MALLOC(sizeof(RtBook)  * nbook);
    book_offsets = (uint32_t*)RT_MALLOC(sizeof(uint32_t)* nbook);
    if (!rt_secs || !rt_books || !book_offsets) { free(buf); freeRuntime(); g_toc_err = "low memory (enable PSRAM)"; return false; }
    book_offsets_cap = nbook;

    // Pass 2: fill (parse each line in place; field separator is '|').
    uint16_t si = 0, bi = 0;
    for (char* ln = buf; *ln; ) {
        char* nl = strchr(ln, '\n');
        if (nl) *nl = 0;                          // terminate this line
        // strip a trailing '\r' (in case the file has CRLF endings)
        size_t len = strlen(ln);
        while (len && (ln[len - 1] == '\r' || ln[len - 1] == ' ')) ln[--len] = 0;

        if (len >= 2 && ln[1] == '|') {
            if (ln[0] == 'S' && si < nsec) {
                strncpy(rt_secs[si].name, ln + 2, RT_SEC_NAME_LEN - 1);
                rt_secs[si].name[RT_SEC_NAME_LEN - 1] = 0;
                utf8Encode(rt_secs[si].name);   // UTF-8 umlauts → private codes for rendering
                rt_secs[si].start = 0; rt_secs[si].len = 0;
                si++;
            } else if (ln[0] == 'B' && bi < nbook) {
                // B|<code>|<display>|<chapters>|<sectionIndex>|<byteOffset>
                char* f1 = strchr(ln + 2, '|');
                char* f2 = f1 ? strchr(f1 + 1, '|') : nullptr;
                char* f3 = f2 ? strchr(f2 + 1, '|') : nullptr;
                char* f4 = f3 ? strchr(f3 + 1, '|') : nullptr;
                if (f1 && f2 && f3 && f4) {
                    *f1 = *f2 = *f3 = *f4 = 0;       // split into fields
                    strncpy(rt_books[bi].code, ln + 2, RT_CODE_LEN - 1);
                    rt_books[bi].code[RT_CODE_LEN - 1] = 0;
                    strncpy(rt_books[bi].display, f1 + 1, RT_DISP_LEN - 1);
                    rt_books[bi].display[RT_DISP_LEN - 1] = 0;
                    utf8Encode(rt_books[bi].display);  // UTF-8 umlauts → private codes
                    uint16_t chaps = (uint16_t)atoi(f2 + 1);
                    rt_books[bi].chapters = chaps ? chaps : 1;
                    rt_books[bi].section  = (uint16_t)atoi(f3 + 1);
                    book_offsets[bi]      = (uint32_t)strtoul(f4 + 1, nullptr, 10);
                    bi++;
                }
            }
        }
        if (!nl) break;
        ln = nl + 1;
    }
    free(buf);
    rt_book_count = bi;
    rt_sec_count  = si;

    // Derive section start/len from the (contiguous, section-grouped) book list.
    for (uint16_t s = 0; s < rt_sec_count; s++) { rt_secs[s].start = 0; rt_secs[s].len = 0; }
    for (uint16_t b = 0; b < rt_book_count; b++) {
        uint16_t s = rt_books[b].section;
        if (s >= rt_sec_count) continue;
        if (rt_secs[s].len == 0) rt_secs[s].start = b;
        rt_secs[s].len++;
    }
    book_idx_valid = true;   // offsets came from the TOC; no .idx scan needed
    book_idx_trans = cur_trans;
    Serial.printf("[%s] TOC %s: %u sections, %u books\n",
                  nvsNamespace(), stem, rt_sec_count, rt_book_count);
    return true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Main menu (root) — pick Bible / Songs / Dictionary
// ─────────────────────────────────────────────────────────────────────────────
static const char* const MENU_LABELS[3] = { "Bible", "Songs", "Dictionary" };

void BibleInterface::goToMainMenu() {
    stopFling();
    // Restore the menu's own appearance/namespace (board-global brightness lives here).
    prefs.end();
    prefs.begin("menu", false);
    mode       = MODE_BIBLE;            // accessors unused at the menu
    dark_mode  = prefs.getBool ("dark",   true);
    accent_idx = prefs.getUChar("accent", 0);
    if (accent_idx >= ACCENT_COUNT) accent_idx = 0;
    font_num   = 2;
    // Keep the current backlight level (avoids a brightness flash when returning
    // from a mode); each mode still applies its own brightness on entry.
    freeRuntime();
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;
    view = BV_MAIN_MENU;
    menu_sel = 0; menu_scroll = 0; scroll_px = 0.f;
    needs_redraw = true;
}

