H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::drawMainMenu() {
    tft.fillScreen(bg());
    drawHeader("ESP-32 Library", false);

    // Each button is shaded with that mode's own saved highlight (accent) colour,
    // read from its NVS namespace. The dark/light variant matches the menu's theme
    // so the accents contrast with the menu background.
    static const char* const MODE_NS[3] = { "bible", "songs", "dict" };
    uint16_t btn_col[3];
    for (uint8_t i = 0; i < 3; i++) {
        Preferences mp;
        uint8_t ac = 0;
        if (mp.begin(MODE_NS[i], true)) {       // read-only
            ac = mp.getUChar("accent", 0);
            mp.end();
        }
        if (ac >= ACCENT_COUNT) ac = 0;
        btn_col[i] = dark_mode ? ACCENT_DARK[ac] : ACCENT_LIGHT[ac];
    }

    const int16_t margin = 16;
    const int16_t gap    = 14;
    int16_t top   = (int16_t)contentY() + 12;
    int16_t avail = (int16_t)scrH() - top - 12;
    int16_t bh    = (avail - gap * 2) / 3;
    for (uint8_t i = 0; i < 3; i++) {
        int16_t y = top + i * (bh + gap);
        tft.fillRoundRect(margin, y, scrW() - 2 * margin, bh, 12, btn_col[i]);
        tft.drawRoundRect(margin, y, scrW() - 2 * margin, bh, 12, dim_fg());
        tft.setTextColor(fg(), btn_col[i]);
        tft.drawCentreString(MENU_LABELS[i], scrW() / 2, y + (bh - 26) / 2, 4);
    }
}

void BibleInterface::handleMainMenuInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);
    if (down && !touch_was_down) {
        touch_was_down = true;
        touch_down_x = tx; touch_down_y = ty;
        return;
    }
    if (!down && touch_was_down) {
        touch_was_down = false;
        const int16_t margin = 16;
        const int16_t gap    = 14;
        int16_t top   = (int16_t)contentY() + 12;
        int16_t avail = (int16_t)scrH() - top - 12;
        int16_t bh    = (avail - gap * 2) / 3;
        for (uint8_t i = 0; i < 3; i++) {
            int16_t y = top + i * (bh + gap);
            if ((int16_t)touch_down_y >= y && (int16_t)touch_down_y < y + bh &&
                (int16_t)touch_down_x >= margin && (int16_t)touch_down_x < (int16_t)scrW() - margin) {
                enterMode((ContentMode)i);
                return;
            }
        }
        // Tap elsewhere (e.g. dismissing a "no files" message) — repaint the menu.
        needs_redraw = true;
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Mode switching
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::enterMode(ContentMode m) {
    prefs.end();
    mode = m;
    freeRuntime();
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;

    prefs.begin(nvsNamespace(), false);
    loadState();                          // per-mode font/dark/accent/position/search
    blSet(prefs.getUChar("bright", 19));  // per-mode brightness (no re-attach)
    loadBookmarks();
    loadSearchHistory();
    scanTranslations();

    if (trans_count == 0) {
        tft.fillScreen(bg());
        drawHeader("ESP-32 Library", false);
        tft.setTextColor(TFT_RED, bg());
        char msg[48];
        snprintf(msg, sizeof(msg), "No %s files on SD", MENU_LABELS[m]);
        tft.drawCentreString(msg, scrW() / 2, scrH() / 2 - 18, 2);
        char where[48];
        snprintf(where, sizeof(where), "Copy .xml to %s/", basePath());
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString(where, scrW() / 2, scrH() / 2 + 6, 2);
        tft.drawCentreString("Tap to go back", scrW() / 2, scrH() / 2 + 30, 2);
        // Stay on the menu state so a tap returns; do not auto-redraw over the message.
        mode = MODE_BIBLE;
        view = BV_MAIN_MENU;
        needs_redraw = false;
        return;
    }
    if (cur_trans >= trans_count) cur_trans = 0;

    // Multiple translations → show the picker; otherwise open the single one.
    if (trans_count > 1) {
        if (mode != MODE_BIBLE) loadToc(trans_stems[cur_trans]);  // so cur_book clamps correctly
        goToTransSelect();
    } else {
        selectTranslation(cur_trans);
    }
}

void BibleInterface::selectTranslation(uint16_t idx) {
    if (idx >= trans_count) idx = 0;
    cur_trans = (uint8_t)idx;
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;

    if (mode != MODE_BIBLE) {
        if (!loadToc(trans_stems[cur_trans])) {
            // Structure file missing/unreadable — tell the user which file, then
            // wait for a tap (rather than silently bouncing to the menu).
            tft.fillScreen(bg());
            drawHeader("ESP-32 Library", false);
            tft.setTextColor(TFT_RED, bg());
            char msg[72];
            snprintf(msg, sizeof(msg), "%s/%s.toc", basePath(), trans_stems[cur_trans]);
            tft.drawCentreString(msg, scrW() / 2, scrH() / 2 - 24, 2);
            tft.setTextColor(dim_fg(), bg());
            char reason[64];
            snprintf(reason, sizeof(reason), "TOC error: %s", g_toc_err[0] ? g_toc_err : "unknown");
            tft.drawCentreString(reason, scrW() / 2, scrH() / 2 - 2, 2);
            tft.drawCentreString("Copy the .toc next to the .xml", scrW() / 2, scrH() / 2 + 20, 2);
            tft.drawCentreString("Tap to go back", scrW() / 2, scrH() / 2 + 42, 2);
            mode = MODE_BIBLE;
            view = BV_MAIN_MENU;
            needs_redraw = false;
            return;
        }
        if (cur_book >= numBooks()) cur_book = 0;
        cur_sec = (numBooks() > 0) ? bookSection(cur_book) : 0;
        if (cur_chapter == 0 || cur_chapter > bookChapters(cur_book)) cur_chapter = 1;
    } else {
        // Bible: ensure the byte-offset buffer exists (filled lazily from the .idx
        // file inside cacheChapter). loadToc() handles this for Songs/Dict.
        if (!book_offsets || book_offsets_cap < BIBLE_BOOK_COUNT) {
            if (book_offsets) free(book_offsets);
            book_offsets     = (uint32_t*)RT_MALLOC(sizeof(uint32_t) * BIBLE_BOOK_COUNT);
            book_offsets_cap = book_offsets ? BIBLE_BOOK_COUNT : 0;
        }
        if (book_offsets) memset(book_offsets, 0, sizeof(uint32_t) * BIBLE_BOOK_COUNT);
        if (cur_book >= numBooks()) cur_book = 0;
        cur_sec = bookSection(cur_book);
    }
    saveState();
    goToSection();
}

void BibleInterface::goBack() {
    stopFling();
    switch (view) {
        case BV_MAIN_MENU:       /* already root */ break;
        case BV_TRANS_SELECT:    goToMainMenu(); break;
        case BV_SECTION_SELECT:
            if (trans_count > 1) goToTransSelect();
            else                 goToMainMenu();
            break;
        case BV_BOOK_SELECT:
            if      (numSecs() > 1)    goToSection();
            else if (trans_count > 1)  goToTransSelect();
            else                       goToMainMenu();
            break;
        case BV_CHAPTER_SELECT:  goToBook(bookSection(cur_book)); break;
        case BV_READING:
            if (reading_from_search) {
                reading_from_search = false;
                highlight_verse     = 0;
                view      = BV_SEARCH_RESULTS;
                scroll_px = (float)menu_scroll * (float)srchH();
                needs_redraw = true;
            } else if (bookChapters(cur_book) <= 1) {
                // Single-chapter book (Song): chapter grid is skipped, so go to
                // the book (song) list rather than back into the reader.
                goToBook(bookSection(cur_book));
            } else {
                goToChapter(cur_book);
            }
            break;
        case BV_SETTINGS:
        case BV_BOOKMARKS:
            bm_confirm_pending = false;
            if (cached_count > 0) {
                view = BV_READING;
                scroll_px = (float)read_line * (float)lineH();
                needs_redraw = true;
            } else {
                goToSection();
            }
            break;
        case BV_SEARCH_RESULTS:
            goToSearchInput();
            break;
        case BV_SEARCH_INPUT:
            search_del_pending = false;
            if (cached_count > 0) {
                view = BV_READING;
                scroll_px = (float)read_line * (float)lineH();
                needs_redraw = true;
            } else {
                goToSection();
            }
            break;
    }
}
void BibleInterface::addBookmarkCurrent() {
    BibleBookmark bm;
    bm.book        = cur_book;
    bm.chapter     = cur_chapter;
    bm.verse_first = sel_verse_first;
    bm.verse_last  = sel_verse_last;
    bm.trans       = cur_trans;   // used by Songs/Dict (book index is per-file)

