H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    if (sel_verse_first > 0) {
        // Verse / range bookmark
        if (sel_verse_first == sel_verse_last)
            snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s %d:%d",
                     bookDisplay(cur_book), cur_chapter, sel_verse_first);
        else
            snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s %d:%d-%d",
                     bookDisplay(cur_book), cur_chapter,
                     sel_verse_first, sel_verse_last);
        // Reject exact duplicates (same book/chapter/verse range)
        for (uint8_t i = 0; i < bm_count; i++) {
            if (bookmarks[i].book == cur_book && bookmarks[i].chapter == cur_chapter
                    && bookmarks[i].verse_first == sel_verse_first
                    && bookmarks[i].verse_last  == sel_verse_last
                    && (mode == MODE_BIBLE || bookmarks[i].trans == cur_trans)) {
                tft.fillRect(scrW()/2, scrH() - navH() - 18, scrW()/2, 16, (uint16_t)0xFD20);
                tft.setTextColor(TFT_BLACK, (uint16_t)0xFD20);
                tft.drawCentreString("Already saved", 3*scrW()/4, scrH() - navH() - 18, 1);
                delay(600);
                needs_redraw = true;
                return;
            }
        }
    } else {
        // Whole-chapter bookmark
        snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s %d",
                 bookDisplay(cur_book), cur_chapter);
        for (uint8_t i = 0; i < bm_count; i++) {
            if (bookmarks[i].book == cur_book && bookmarks[i].chapter == cur_chapter
                    && bookmarks[i].verse_first == 0
                    && (mode == MODE_BIBLE || bookmarks[i].trans == cur_trans)) {
                tft.fillRect(scrW()/2, scrH() - navH() - 18, scrW()/2, 16, (uint16_t)0xFD20);
                tft.setTextColor(TFT_BLACK, (uint16_t)0xFD20);
                tft.drawCentreString("Already saved", 3*scrW()/4, scrH() - navH() - 18, 1);
                delay(600);
                needs_redraw = true;
                return;
            }
        }
    }

    if (bm_count >= BIBLE_MAX_BM) return;
    bookmarks[bm_count++] = bm;
    saveBookmarks();

    // Clear verse selection after saving
    sel_verse_first = sel_verse_last = 0;

    // Brief visual feedback
    tft.fillRect(scrW()/2, scrH() - navH() - 18, scrW()/2, 16, TFT_GREEN);
    tft.setTextColor(TFT_BLACK, TFT_GREEN);
    tft.drawCentreString("Saved", 3*scrW()/4, scrH() - navH() - 18, 1);
    delay(600);
    needs_redraw = true;
}
void BibleInterface::jumpToBookmark(uint8_t bm_idx) {
    // Songs/Dict bookmarks are translation-scoped — switch file and reload its
    // structure if the bookmark belongs to a different translation than the one open.
    if (mode != MODE_BIBLE && bookmarks[bm_idx].trans != cur_trans &&
        bookmarks[bm_idx].trans < trans_count) {
        cur_trans = bookmarks[bm_idx].trans;
        if (!loadToc(trans_stems[cur_trans])) { goToMainMenu(); return; }
    }
    cur_book    = bookmarks[bm_idx].book;
    if (cur_book >= numBooks()) { goToSection(); return; }
    cur_chapter = bookmarks[bm_idx].chapter;
    cur_sec     = bookSection(cur_book);
    goToReading(cur_chapter, 0);  // builds lines[], sets scroll_px=0

    // If it's a verse bookmark, scroll to the first selected verse
    uint8_t v = bookmarks[bm_idx].verse_first;
    if (v > 0) {
        for (int16_t k = 0; k < (int16_t)line_count; k++) {
            if (lines[k][0] == '^') {
                const char* pipe = strchr(lines[k] + 1, '|');
                if (pipe && (uint8_t)atoi(lines[k] + 1) == v) {
                    scroll_px = (float)k * (float)lineH();
                    read_line = k;
                    break;
                }
            }
        }
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Momentum scroll helpers
// ─────────────────────────────────────────────────────────────────────────────

void BibleInterface::stopFling() {
    fling_active = false;
    fling_vel    = 0.f;
    memset(vbuf_y, 0, sizeof(vbuf_y));
    memset(vbuf_t, 0, sizeof(vbuf_t));
    vbuf_i = 0;
}

void BibleInterface::recordVel(int16_t y, uint32_t t) {
    vbuf_i          = (vbuf_i + 1) & 3;
    vbuf_y[vbuf_i]  = y;
    vbuf_t[vbuf_i]  = t;
}

float BibleInterface::computeFlingVel() const {
    uint8_t newest = vbuf_i;
    for (int back = 3; back >= 1; back--) {
        uint8_t old  = (vbuf_i - (uint8_t)back) & 3;
        uint32_t dt  = vbuf_t[newest] - vbuf_t[old];
        if (dt >= 8 && dt <= 120) {
            float vel = (float)(vbuf_y[newest] - vbuf_y[old]) / (float)dt;
            return -vel * 1000.f;   // px/s; negated: finger-up → positive fling
        }
    }
    return 0.f;
}

void BibleInterface::updateFling(uint32_t now) {
    float dt = (float)(now - fling_ms) * 0.001f;
    fling_ms = now;
    if (dt <= 0.f || dt > 0.5f) return;

    // Determine max_px and unit for the current view
    float max_px = 0.f;
    switch (view) {
        case BV_TRANS_SELECT:
            max_px = (float)max(0, (int)trans_count - (int)visItems()) * (float)itemH();
            break;
        case BV_SECTION_SELECT:
            max_px = 0.f;   // section list always fits, no fling needed
            break;
        case BV_BOOK_SELECT:
            max_px = (float)max(0, (int)secLen(cur_sec) - (int)visItems()) * (float)itemH();
            break;
        case BV_CHAPTER_SELECT: {
            uint16_t  chaps      = bookChapters(cur_book);
            uint8_t  tile_h     = 36;
            uint8_t  vis_rows   = (uint8_t)(contentH() / tile_h);
            int16_t  total_rows = ((int16_t)chaps + 4) / 5;
            max_px = (float)max(0, (int)total_rows - (int)vis_rows) * (float)tile_h;
            break;
        }
        case BV_READING:
            max_px = (float)max(0, (int)line_count - (int)visLines()) * (float)lineH();
            break;
        case BV_BOOKMARKS:
            max_px = (float)max(0, (int)bm_count - (int)visItems()) * (float)itemH();
            break;
        case BV_SEARCH_INPUT:
            max_px = (float)max(0, (int)search_hist_count - (int)visItems()) * (float)itemH();
            break;
        case BV_SEARCH_RESULTS:
            max_px = (float)max(0, (int)search_result_count - (int)visSearchItems()) * (float)srchH();
            break;
        default:
            fling_active = false;
            return;
    }

