H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    scroll_px += fling_vel * dt;
    if (scroll_px < 0.f)     scroll_px = 0.f;
    if (scroll_px > max_px)  scroll_px = max_px;

    // Exponential decay — velocity halves every ~350ms
    fling_vel *= expf(-2.0f * dt);

    if (fabsf(fling_vel) < 30.f || scroll_px <= 0.f || scroll_px >= max_px)
        fling_active = false;

    // Sync integer scroll vars and do a partial redraw
    switch (view) {
        case BV_TRANS_SELECT:
        case BV_SECTION_SELECT:
        case BV_BOOK_SELECT:
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            redrawListContent(
                view == BV_TRANS_SELECT   ? trans_count :
                view == BV_SECTION_SELECT ? numSecs() :
                                            secLen(cur_sec));
            break;
        case BV_CHAPTER_SELECT:
            menu_scroll = (int16_t)(scroll_px / 36.f);
            redrawChapterContent();
            break;
        case BV_READING:
            // read_line is updated inside drawReadingLines via scroll_px
            drawReadingLines();
            break;
        case BV_BOOKMARKS:
            bm_scroll = (int16_t)(scroll_px / (float)itemH());
            redrawListContent(bm_count);
            break;
        case BV_SEARCH_INPUT:
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            redrawListContent(search_hist_count);
            break;
        case BV_SEARCH_RESULTS:
            menu_scroll = (int16_t)(scroll_px / (float)srchH());
            redrawSearchResultsContent();
            break;
        default: break;
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// XML streaming parser — caches all verses for one chapter
// ─────────────────────────────────────────────────────────────────────────────

// Read one byte from the XML file (buffered in 512-byte chunks)
bool BibleInterface::xmlNextByte(XmlState& s, char& c) {
    if (s.chunk_pos >= s.chunk_len) {
        s.chunk_len = s.f.read(s.chunk, XML_CHUNK_SIZE);
        s.chunk_pos = 0;
        if (s.chunk_len <= 0) return false;
    }
    c = (char)s.chunk[s.chunk_pos++];
    return true;
}

// Decode common XML entities in-place
void BibleInterface::xmlDecodeEntities(char* buf, size_t len) {
    struct { const char* ent; char ch; } map[] = {
        { "&amp;", '&' }, { "&lt;", '<' }, { "&gt;", '>' },
        { "&apos;", '\'' }, { "&quot;", '"' }, { "&nbsp;", ' ' },
        { nullptr, 0 }
    };
    for (size_t i = 0; i < len && buf[i]; i++) {
        if (buf[i] != '&') continue;
        for (int m = 0; map[m].ent; m++) {
            size_t elen = strlen(map[m].ent);
            if (strncmp(buf + i, map[m].ent, elen) == 0) {
                buf[i] = map[m].ch;
                memmove(buf + i + 1, buf + i + elen, len - i - elen);
                break;
            }
        }
    }
}

// Compress 2-byte UTF-8 German sequences to private single-byte codes:
//   0x80=Ä  0x81=ä  0x82=Ö  0x83=ö  0x84=Ü  0x85=ü  0x86=ß (pixel-drawn)
// All other unrecognised multi-byte sequences: lead byte is kept, trail byte dropped.
// Uses read/write pointers so no additional buffer is needed.
void BibleInterface::utf8Encode(char* buf) {
    char* r = buf;
    char* w = buf;
    while (*r) {
        uint8_t b  = (uint8_t)*r;
        uint8_t b1 = (b >= 0x80) ? (uint8_t)r[1] : 0;   // 0 if string ends early
        uint8_t b2 = (b >= 0xE0 && b1) ? (uint8_t)r[2] : 0;

        if (b < 0x80) { *w++ = *r++; continue; }         // plain ASCII

        // ── 2-byte: Latin-1 supplement (0xC2/0xC3) ────────────────────────────
        if (b == 0xC3 && b1) {
            switch (b1) {
                case 0x84: *w++ = (char)0x80; break;     // Ä
                case 0xA4: *w++ = (char)0x81; break;     // ä
                case 0x96: *w++ = (char)0x82; break;     // Ö
                case 0xB6: *w++ = (char)0x83; break;     // ö
                case 0x9C: *w++ = (char)0x84; break;     // Ü
                case 0xBC: *w++ = (char)0x85; break;     // ü
                case 0x9F: *w++ = (char)0x86; break;     // ß
                default:   /* other accented Latin — drop */ break;
            }
            r += 2; continue;
        }
        if (b == 0xC2 && b1) {
            if      (b1 == 0xA0) *w++ = ' ';             // non-breaking space
            else if (b1 == 0xB4) *w++ = '\'';            // ´ acute accent
            /* else (©, °, …) drop */
            r += 2; continue;
        }

        // ── 3-byte: punctuation (0xE2 …) mapped to ASCII equivalents ──────────
        if (b == 0xE2 && b1 && b2) {
            if (b1 == 0x80) {
                switch (b2) {
                    case 0x98: case 0x99: case 0x9A: case 0x9B:
                        *w++ = '\''; break;                       // ‘ ’ ‚ ‛
                    case 0x9C: case 0x9D: case 0x9E: case 0x9F:
                        *w++ = '"';  break;                       // “ ” „ ‟
                    case 0x90: case 0x91: case 0x93: case 0x94: case 0x95:
                        *w++ = '-';  break;                       // ‐ ‑ – — ―
                    case 0xA6: *w++ = '.'; *w++ = '.'; *w++ = '.'; break;  // …
                    case 0xA2: *w++ = '*';  break;                // • bullet
                    case 0xAF: *w++ = ' ';  break;                // narrow nbsp
                    default: break;                               // zwsp etc. drop
                }
            } else if (b1 == 0x88 && b2 == 0x92) {
                *w++ = '-';                                       // − minus sign
            }
            r += 3; continue;
        }

        // ── Any other multibyte sequence: drop it whole (never leak a byte) ────
        if (b >= 0xF0)      r += (r[1] && r[2] && r[3]) ? 4 : 1;  // 4-byte
        else if (b >= 0xE0) r += (b1 && b2) ? 3 : 1;             // 3-byte
        else if (b >= 0xC0) r += b1 ? 2 : 1;                     // 2-byte
        else                r += 1;                              // stray continuation
    }
    *w = 0;
}

// Measure pixel width of a string that may contain private codes 0x80-0x86.
// Substitutes the base letter for measurement (widths are nearly identical).
int16_t BibleInterface::textWidthUTF8(const char* str, uint8_t font) {
    static const char bases[] = {'A','a','O','o','U','u'};
    char tmp[BIBLE_LINE_BUF];
    size_t j = 0;
    for (const char* p = str; *p && j < BIBLE_LINE_BUF - 1; p++) {
        uint8_t c = (uint8_t)*p;
        if      (c >= 0x80 && c <= 0x85) tmp[j++] = bases[c - 0x80];
        else if (c == 0x86)               tmp[j++] = 'B';  // ß ≈ B width
        else                              tmp[j++] = *p;
    }
    tmp[j] = 0;
    return tft.textWidth(tmp, font);
}

// Draw a string that may contain private codes 0x80-0x86.
// Umlauts (0x80-0x85): base letter + two diaeresis dots via bibleDrawUmlautDots().
// ß (0x86): pixel-drawn glyph via bibleDrawSzlig().
void BibleInterface::drawStringUTF8(TFT_eSprite& spr, const char* str, int16_t x, int16_t y,
                                     uint8_t font, uint16_t color) {
    static const char bases[] = {'A','a','O','o','U','u'};

    for (const char* p = str; *p; p++) {
        uint8_t c = (uint8_t)*p;
        if (c == 0x86) {
            x += bibleDrawSzlig(spr, x, y, font, color);
        } else if (c >= 0x80 && c <= 0x85) {
            int16_t w    = spr.drawChar((uint16_t)bases[c - 0x80], x, y, font);
            bool is_lower = ((c - 0x80) & 1) != 0;  // 0x81/0x83/0x85 = ä/ö/ü
            bibleDrawUmlautDots(spr, x, y, w, is_lower, font, color);
            x += w;
        } else {
            x += spr.drawChar((uint16_t)(uint8_t)*p, x, y, font);
        }
    }
}

