H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// Render ß (private code 0x86) as a pixel-drawn glyph matching each font size.
// Returns the advance width (pixels to next character).
//
// Glyph designs (y = top of character cell, same coordinate as drawChar):
//
//   Font 1 (GLCD 8px) — 6-col canvas, advance 6
//     .##...   row 0  top arch
//     #..#..   row 1  open counters
//     #..#..   row 2
//     #.#...   row 3  diagonal mid-junction
//     #..#..   row 4
//     #...#.   row 5  lower lobe widens
//     #...#.   row 6
//     ..##..   row 7  bottom tail
//
//   Font 2 (Font16 16px) — 8-col canvas, advance 8
//     .###....  row 3  top arch (3px)
//     #...#...  row 4  open counters
//     ...
//     #.##....  row 7  mid junction (cols 2-3)
//     #...#...  row 8
//     #....#..  rows 9-11  lower lobe widens to col 5
//     #...#...  row 12
//     ..##....  row 13 bottom tail
//
//   Font 4 (Font32 26px) — 13-col canvas, advance 13
//     Smooth curved ß: 2px-wide left stem (cols 1-2, rows 5-17),
//     rounded upper loop, rounded lower lobe, curved bottom tail.
int16_t BibleInterface::drawSzlig(TFT_eSprite& spr, int16_t x, int16_t y,
                                   uint8_t font, uint16_t color) {
    return bibleDrawSzlig(spr, x, y, font, color);
}

// Extract attribute value from a tag string like:  verse osisID="Gen.1.1"
bool BibleInterface::xmlGetAttr(const char* tag, const char* attr, char* out, size_t out_len) {
    const char* p = strstr(tag, attr);
    if (!p) return false;
    p += strlen(attr);
    while (*p == ' ') p++;
    if (*p != '=') return false;
    p++;
    while (*p == ' ') p++;
    char delim = (*p == '"' || *p == '\'') ? *p++ : ' ';
    size_t n = 0;
    while (*p && *p != delim && n < out_len - 1)
        out[n++] = *p++;
    out[n] = 0;
    return (n > 0);
}

bool BibleInterface::cacheChapter(uint16_t book, uint16_t chapter) {
    if (cached_book == book && cached_chap == chapter) return (cached_count > 0);
    cached_count = 0;
    cached_book  = book;
    cached_chap  = chapter;

    if (trans_count == 0 || book >= numBooks()) return false;

    // ── Book byte-offset index ─────────────────────────────────────────────
    // Bible: load (or build+save) the .idx so we can seek directly to a book.
    // Songs/Dict: book_offsets[] is already filled by loadToc() (no .idx scan).
    if (mode == MODE_BIBLE && (!book_idx_valid || book_idx_trans != cur_trans)) {
        if (!loadBookIndex(trans_stems[cur_trans])) {
            buildBookIndex(trans_stems[cur_trans]);
            saveBookIndex(trans_stems[cur_trans]);
        }
        book_idx_valid = true;
        book_idx_trans = cur_trans;
    }

    // Build file path: /bible/<stem>.xml
    char path[64];
    snprintf(path, sizeof(path), "%s/%s.xml", basePath(), trans_stems[cur_trans]);

    File f = SD.open(path);
    if (!f) {
        Serial.print(F("[Bible] Cannot open ")); Serial.println(path);
        return false;
    }

    // Seek to the book's starting byte — skips all preceding books
    if (book_offsets[book] > 0)
        f.seek(book_offsets[book]);

    // Build the osisID prefix we are looking for: "Book.Chapter."
    // e.g. "Gen.1." for Genesis chapter 1
    char prefix[32];
    snprintf(prefix, sizeof(prefix), "%s.%d.", bookCode(book), chapter);
    size_t prefix_len = strlen(prefix);

    // Build the osisID prefix for the NEXT chapter so we know when to stop
    char next_prefix[32];
    snprintf(next_prefix, sizeof(next_prefix), "%s.%d.", bookCode(book), chapter + 1);

    XmlState s;
    memset(&s, 0, sizeof(s));
    s.f          = f;
    s.chunk_len  = 0;
    s.chunk_pos  = 0;
    s.in_verse   = false;
    s.in_note    = false;
    s.nest_level = 0;
    s.collecting = false;
    s.verse_text_len = 0;

    // State machine
    // States: outside tag, inside tag, inside verse text, inside note
    enum { ST_TEXT, ST_TAG } st = ST_TEXT;
    char c;
    char tag_buf[XML_TAG_BUF];
    int  tag_len = 0;
    bool done    = false;

    while (!done && xmlNextByte(s, c)) {
        if (st == ST_TEXT) {
            if (c == '<') {
                st = ST_TAG;
                tag_len = 0;
                continue;
            }
            // Collect text if we are inside a target verse and not in a note
            if (s.in_verse && !s.in_note && s.collecting) {
                if (s.verse_text_len < BIBLE_VERSE_BUF - 2) {
                    s.verse_text[s.verse_text_len++] = c;
                }
            }
        } else { // ST_TAG
            if (c == '>') {
                st = ST_TEXT;
                tag_buf[tag_len] = 0;

                bool closing = (tag_buf[0] == '/');
                const char* tname = closing ? tag_buf + 1 : tag_buf;

                // Skip XML declaration, comments, DOCTYPE
                if (tag_buf[0] == '?' || tag_buf[0] == '!') {
                    tag_len = 0; continue;
                }

                if (!closing) {
                    // Opening or self-closing tag
                    bool self_close = (tag_len > 0 && tag_buf[tag_len-1] == '/');
                    if (self_close) { tag_buf[tag_len-1] = 0; }

                    // Is this a <verse ...> tag?
                    if (strncmp(tname, "verse", 5) == 0 &&
                        (tname[5] == ' ' || tname[5] == '\t' || tname[5] == 0)) {
                        char osis_id[64] = {0};
                        if (xmlGetAttr(tag_buf, "osisID", osis_id, sizeof(osis_id))) {
                            if (strncmp(osis_id, prefix, prefix_len) == 0) {
                                // This is a verse we want
                                s.in_verse = true;
                                s.nest_level = 1;
                                s.verse_text_len = 0;
                                s.in_note = false;
                                s.collecting = !self_close;
                                if (self_close) {
                                    // Self-closing verse with no text (rare)
                                    s.in_verse = false;
                                }
                            } else if (strncmp(osis_id, next_prefix, strlen(next_prefix)) == 0) {
                                // We've gone past our chapter — stop
                                done = true;
                            } else if (cached_count > 0) {
                                // A verse from a different book/chapter appeared after
                                // we already collected ours — we're done. (Verses are
                                // contiguous, so this is the safe stop for the last
                                // chapter of a book and for single-chapter songs.)
                                done = true;
                            }
                        }
                    } else if (s.in_verse) {
                        // Tag inside a verse
                        if (strncmp(tname, "note", 4) == 0) {
                            s.in_note = true;
                        }
                        if (!self_close) s.nest_level++;
                    }
                } else {
                    // Closing tag
                    if (strncmp(tname, "verse", 5) == 0 && s.in_verse) {
                        // End of verse — save it
                        s.verse_text[s.verse_text_len] = 0;
                        xmlDecodeEntities(s.verse_text, BIBLE_VERSE_BUF);
                        utf8Encode(s.verse_text);
                        // Trim trailing whitespace
                        int vlen = strlen(s.verse_text);
                        while (vlen > 0 && (s.verse_text[vlen-1] == ' ' ||
                               s.verse_text[vlen-1] == '\n' ||
                               s.verse_text[vlen-1] == '\r')) {
                            s.verse_text[--vlen] = 0;
                        }
                        if (cached_count < BIBLE_MAX_VERSES_CACHED) {
                            strncpy(verse_buf[cached_count], s.verse_text, BIBLE_VERSE_BUF - 1);
                            verse_buf[cached_count][BIBLE_VERSE_BUF - 1] = 0;
                            cached_count++;
                        }
                        s.in_verse = false;
                        s.in_note  = false;
                        s.nest_level = 0;
                        s.collecting = false;
                    } else if (s.in_verse) {
                        if (strncmp(tname, "note", 4) == 0) s.in_note = false;
                        if (s.nest_level > 1) s.nest_level--;
                    }
                }
                tag_len = 0;
            } else {
                if (tag_len < XML_TAG_BUF - 1)
                    tag_buf[tag_len++] = c;
            }
        }
    }

    f.close();
    Serial.printf("[Bible] Cached %d verses for %s ch %d\n",
                  cached_count, bookDisplay(book), chapter);
    return (cached_count > 0);
}

// ─────────────────────────────────────────────────────────────────────────────
// Text wrapping — builds lines[] from verse_buf[]
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::buildWrappedLines() {
    line_count = 0;
    uint16_t max_px = scrW() - 14;  // 4px left pad + 10px right pad

    for (uint8_t v = 0; v < cached_count && line_count < BIBLE_MAX_LINES; v++) {
        addWrappedLine(v + 1, verse_buf[v], max_px, font_num, line_count);
        // Songs: blank line between stanzas for readability (not after the last).
        if (mode == MODE_SONGS && v + 1 < cached_count && line_count < BIBLE_MAX_LINES) {
            lines[line_count][0] = 0;
            line_count++;
        }
    }
}

