H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::drawSearchDelConfirm() {
    int16_t pop_w = (int16_t)scrW() - 40;
    int16_t pop_h = 80;
    int16_t pop_x = 20;
    int16_t pop_y = (int16_t)(scrH() / 2) - 40;

    tft.fillRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, bg());
    tft.drawRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, dim_fg());
    tft.drawRoundRect(pop_x + 1, pop_y + 1, pop_w - 2, pop_h - 2, 6, dim_fg());

    tft.setTextColor(fg(), bg());
    tft.drawCentreString("Delete from history?", scrW() / 2, pop_y + 10, 2);

    int16_t btn_y  = pop_y + 44;
    int16_t btn_h  = 28;
    int16_t half_w = pop_w / 2 - 6;
    int16_t del_x  = pop_x + pop_w / 2 + 2;

    tft.fillRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, dim_fg());
    tft.setTextColor(TFT_WHITE, hdr_bg());
    tft.drawCentreString("Cancel", pop_x + 4 + half_w / 2, btn_y + (btn_h - 8) / 2, 1);

    tft.fillRoundRect(del_x, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(del_x, btn_y, half_w, btn_h, 4, TFT_RED);
    tft.setTextColor(TFT_RED, hdr_bg());
    tft.drawCentreString("Delete", del_x + half_w / 2, btn_y + (btn_h - 8) / 2, 1);
}

// Draws one search result row: reference on top line, snippet (with highlighted
// query text) on second line.  y_px is the absolute screen Y of the row top.
// Drawing is clipped by any active TFT viewport (set by redrawSearchResultsContent).
void BibleInterface::drawSearchResultRow(int16_t y_px, uint16_t idx, bool sel) {
    const int16_t SBAR_W  = 6;
    const int16_t PADDING = 4;
    int16_t row_w = (int16_t)scrW() - SBAR_W;
    int16_t row_h = (int16_t)srchH();

    uint16_t bg_col = sel ? sel_bg() : bg();
    tft.fillRect(0, y_px, row_w, row_h, bg_col);
    // Divider line at bottom of row
    tft.drawFastHLine(0, y_px + row_h - 1, row_w, dim_fg());

    // Reference line in font 2 (16px). Rendered char-by-char so song titles with
    // umlauts (private codes) display correctly.
    {
        BibleSearchResult& r = search_results[idx];
        char ref[48];
        if (mode == MODE_SONGS) {
            if (r.trans == cur_trans) {
                snprintf(ref, sizeof(ref), "%s", bookDisplay(r.book));  // song title
            } else {
                // "All" hit in another songbook — show the songbook name (uppercased).
                char nm[BIBLE_TRANS_LEN];
                strncpy(nm, (r.trans < trans_count) ? trans_stems[r.trans] : "?", sizeof(nm) - 1);
                nm[sizeof(nm) - 1] = 0;
                for (char* p = nm; *p; ++p) *p = (char)toupper((unsigned char)*p);
                snprintf(ref, sizeof(ref), "%s", nm);
            }
        } else {
            snprintf(ref, sizeof(ref), "%s %d:%d",
                     bookDisplay(r.book), (int)r.chapter, (int)r.verse);
        }
        tft.setTextColor(fg(), bg_col);
        int16_t rx = PADDING;
        for (const char* p = ref; *p && rx < row_w - 4; p++)
            rx += tftCharUTF8(tft, (uint8_t)*p, rx, y_px + 3, 2, fg());
    }

    // Snippet in font 1 (8px) with highlighted query segments.
    // disp/qdisp hold ASCII base letters (for case-insensitive match); snip holds
    // the original private codes so rendering shows proper umlauts/ß.
    // Private codes are 1-byte just like ASCII, so indices are identical between
    // snip and disp — we match on disp, render from snip.
    int16_t snip_y = y_px + 23;
    const char* snip = search_results[idx].snippet;

    static const char bases[] = {'A','a','O','o','U','u','B'};
    char disp[BIBLE_SRCH_SNIPPET_LEN];
    {
        const char* src = snip;
        size_t di = 0;
        for (; *src && di < BIBLE_SRCH_SNIPPET_LEN - 1; src++) {
            uint8_t bc = (uint8_t)*src;
            disp[di++] = (bc >= 0x80 && bc <= 0x86) ? bases[bc - 0x80] : *src;
        }
        disp[di] = 0;
    }
    char qdisp[BIBLE_SEARCH_QUERY_LEN];
    {
        const char* qs = search_query;
        size_t qi = 0;
        for (; *qs && qi < BIBLE_SEARCH_QUERY_LEN - 1; qs++) {
            uint8_t bc = (uint8_t)*qs;
            qdisp[qi++] = (bc >= 0x80 && bc <= 0x86) ? bases[bc - 0x80] : *qs;
        }
        qdisp[qi] = 0;
    }
    size_t qlen = strlen(qdisp);

    // Build the set of tokens to highlight.
    // Phrase mode: one token = the full (possibly punct-stripped) query.
    // Partial mode: one token per space-delimited word.
    // Each token is punct-stripped when srch_ignore_punct is on.
    struct Token { char s[BIBLE_SEARCH_QUERY_LEN]; size_t len; };
    Token  tokens[16];
    int    ntokens = 0;

    // Source string for splitting: qdisp (private-codes mapped to ASCII bases)
    // with punctuation stripped if needed.
    char qbase[BIBLE_SEARCH_QUERY_LEN];  // punct-stripped qdisp
    {
        size_t qi = 0;
        for (size_t i = 0; qdisp[i] && qi < BIBLE_SEARCH_QUERY_LEN - 1; i++) {
            uint8_t c = (uint8_t)qdisp[i];
            if (srch_ignore_punct && c < 0x80 && ispunct((int)c)) continue;
            qbase[qi++] = qdisp[i];
        }
        qbase[qi] = 0;
    }

    if (srch_partial_match) {
        const char* p = qbase;
        while (*p && ntokens < 16) {
            while (*p == ' ') p++;
            if (!*p) break;
            const char* ws = p;
            while (*p && *p != ' ') p++;
            size_t wl = (size_t)(p - ws);
            if (wl > 0 && wl < BIBLE_SEARCH_QUERY_LEN) {
                memcpy(tokens[ntokens].s, ws, wl);
                tokens[ntokens].s[wl] = 0;
                tokens[ntokens].len   = wl;
                ntokens++;
            }
        }
    } else {
        size_t bl = strlen(qbase);
        if (bl > 0) {
            memcpy(tokens[0].s, qbase, bl + 1);
            tokens[0].len = bl;
            ntokens = 1;
        }
    }

    tft.setTextDatum(TL_DATUM);
    int16_t sx     = PADDING;
    int16_t max_sx = row_w - PADDING;
    size_t  si     = 0;

    while (disp[si] && sx < max_sx) {
        // Try each token at position si; take the first match.
        bool   found     = false;
        size_t match_end = 0;

