H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
        }
        // Tap selects item only — use View button to run the search
    }
}

void BibleInterface::handleSearchResultsInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW() / 3) {
                goBack();
            } else if (tx > 2 * (scrW() / 3)) {
                if (search_result_count > 0 &&
                    search_res_sel >= 0 &&
                    search_res_sel < (int16_t)search_result_count)
                    jumpToSearchResult((uint16_t)search_res_sel);
            }
            return;
        }
        // Hit-test: which search result row was tapped?
        if ((int16_t)ty >= (int16_t)contentY() &&
            (int16_t)ty <  (int16_t)(contentY() + contentH())) {
            int16_t hi = (int16_t)((ty - contentY()) / srchH());
            int16_t abs_idx = menu_scroll + hi;
            if (abs_idx < (int16_t)search_result_count) {
                search_res_sel = abs_idx;
                redrawSearchResultsContent();
            }
        }
        return;
    }

    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
        }
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)search_result_count - (int)visSearchItems())
                           * (float)srchH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px   = new_px;
            menu_scroll = (int16_t)(scroll_px / (float)srchH());
            recordVel((int16_t)ty, millis());
            redrawSearchResultsContent();
        }
        return;
    }

    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }
        // Tap selects; navigation is via the View button
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Search — jump to a result in the reading view
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::jumpToSearchResult(uint16_t idx) {
    if (idx >= search_result_count) return;
    BibleSearchResult& r = search_results[idx];

    // Songs "All" results may live in another songbook — switch to it first.
    if (mode != MODE_BIBLE && r.trans != cur_trans && r.trans < trans_count) {
        cur_trans = r.trans;
        prefs.putUChar("trans", cur_trans);
        if (!loadToc(trans_stems[cur_trans])) { goToMainMenu(); return; }
    }

    highlight_verse     = r.verse;
    reading_from_search = true;
    cur_book    = r.book;
    if (cur_book >= numBooks()) { goToSection(); return; }
    cur_chapter = r.chapter;
    cur_sec     = bookSection(cur_book);

    drawLoading();
    view = BV_READING;
    cacheChapter(cur_book, cur_chapter);
    buildWrappedLines();

    // Find the first wrapped line for this verse
    int16_t start = 0;
    char prefix[16];
    snprintf(prefix, sizeof(prefix), "^%d|", (int)r.verse);
    size_t plen = strlen(prefix);
    for (uint16_t i = 0; i < line_count; i++) {
        if (strncmp(lines[i], prefix, plen) == 0) {
            start = (int16_t)i;
            break;
        }
    }
    read_line = start;
    scroll_px = (float)start * (float)lineH();
    saveState();
    needs_redraw = true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Search — streaming XML full-Bible search with progress bar
// ─────────────────────────────────────────────────────────────────────────────
bool BibleInterface::parseOsisID(const char* osisID,
                                  uint16_t& book_out,
                                  uint16_t& chap_out,
                                  uint8_t& verse_out) {
    const char* dot1 = strchr(osisID, '.');
    if (!dot1) return false;
    const char* dot2 = strchr(dot1 + 1, '.');
    if (!dot2) return false;
    int code_len = (int)(dot1 - osisID);
    for (uint16_t b = 0; b < numBooks(); b++) {
        if ((int)strlen(bookCode(b)) == code_len &&
            strncmp(osisID, bookCode(b), code_len) == 0) {
            book_out  = b;
            chap_out  = (uint16_t)atoi(dot1 + 1);
            verse_out = (uint8_t)atoi(dot2 + 1);
            return true;
        }
    }
    return false;
}

bool BibleInterface::searchContains(const char* text, const char* query) {
    if (!query || !query[0]) return false;

    // When ignoring punctuation, strip it from both inputs into static buffers
    // (single-threaded — no re-entrancy concern).
    static char t2[BIBLE_VERSE_BUF];
    static char q2[BIBLE_SEARCH_QUERY_LEN];
    const char* t = text;
    const char* q = query;
    if (srch_ignore_punct) {
        size_t ti = 0;
        for (const char* p = text; *p && ti < BIBLE_VERSE_BUF - 1; p++) {
            uint8_t c = (uint8_t)*p;
            if (c < 0x80 && ispunct((int)c)) continue;
            t2[ti++] = *p;
        }
        t2[ti] = 0;
        t = t2;

